Tekla.Structures.ModelInternal.BimModelDataProduct.DTO.FileOperation
Represents the operation required to upload a file, including the URL, HTTP method, and expiration time.

Tekla.Structures.ModelInternal.BimModelDataProduct.DTO.FileOperation.Url
Gets or sets the file upload/download url

Tekla.Structures.ModelInternal.BimModelDataProduct.DTO.FileOperation.Method
Gets or sets the http method for the file upload

Tekla.Structures.ModelInternal.BimModelDataProduct.DTO.FileOperation.ExpiresAt
Gets or sets the timestamp for the url expiration